Repository: stanley-pilgrim/Isomers
Catalog: Assets/Varwin/Core/SmartLocalizationWorkspace/Data/LanguageData/Language.*.resx
Languages: cn, kk, ru

# LIST_ERROR_GET_FIRST_ITEM
source: Error while getting the first element of the list.
cn: 取得清單第一個元素時出錯。
kk: Тізімнің бірінші элементін алу кезіндегі қате.
ru: Ошибка при получении первого элемента списка.

# LIST_ERROR_GET_INDEX_OF_ITEM
source: Error of getting index of an element.
cn: 取得元素索引的錯誤。
kk: Тізім элементінің индексін алу қатесі.
ru: Ошибка получения индекса элемента списка.

# LIST_ERROR_GET_ITEM
source: Get list item error.
cn: 取得清單項目 錯誤。
kk: Тізім элементін алу қатесі.
ru: Ошибка получения элемента списка.

# LIST_ERROR_GET_LAST_INDEX_OF
source: Error of getting the last index of an element of the list.
cn: 取得清單元素最後索引的錯誤。
kk: Тізім элементінің соңғы кіру индексін табу кезіндегі қате.
ru: Ошибка при нахождении последнего индекса вхождения элемента списка.

# LIST_ERROR_GET_LAST_ITEM
source: Get last list item error.
cn: 取得最後一個清單項目錯誤。
kk: Тізімнің соңғы элементін алу кезіндегі қате.
ru: Ошибка при получении последнего элемента списка.

# LIST_ERROR_GET_RANDOM_ITEM
source: Get list random item error.
cn: 取得清單隨機項目錯誤。
kk: Тізімнен кездейсоқ элементті алу қатесі.
ru: Ошибка получения случайного элемента из списка.

# LIST_ERROR_GET_SUBLIST
source: Error when trying to get sub list.
cn: 嘗試取得子清單時發生錯誤。
kk: Ішкі тізімді алу кезіндегі қате.
ru: Ошибка при получении подсписка.

# LIST_ERROR_SET_ITEM
source: Error when trying to set an item to the list.
cn: 嘗試將項目設定到清單時發生錯誤。
kk: Тізімнің мәнін индекс бойынша анықтау кезіндегі қате.
ru: Ошибка при установлении значения списка по индексу.

# LIST_OF_NOT_LINUX_READY_OBJECTS
source: Objects or scene templates that don't have Linux support
cn: 不支持 Linux 的對像或場景模板
kk: Linux қолдауы жоқ объектілер немесе сахна шаблондары
ru: Объекты или шаблоны сцен, которые не имеют поддержки Linux

# LOAD_OBJECT_ERROR
source: Can't load the object
cn: 對象加載錯誤
kk: Объектіні жүктеу қатесі
ru: Ошибка загрузки объекта

# LOAD_PROJECTS_ERROR
source: Can't load projects list
cn: 加載項目列表時出錯
kk: Жобалардың тізімін жүктеу қатесі
ru: Ошибка загрузки списка проектов

# LOAD_RESOURCE_ERROR
source: Can't load resource
cn: 資源加載錯誤
kk: Ресурсты жүктеу қатесі
ru: Ошибка загрузки ресурса

# LOAD_SCENE_ERROR
source: Can't load scene template
cn: 場景模板加載錯誤
kk: Сахна шаблонын жүктеу қатесі
ru: Ошибка загрузки шаблона сцены

# LOAD_WORKSPACES_ERROR
source: Can't load workspaces list
cn: 加載工作區列表時出錯
kk: Жұмыс кеңістіктерінің тізімін жүктеу қатесі
ru: Ошибка загрузки списка рабочих пространств

source: Loading
cn: 正在加載
kk: Жүктеу
ru: Загрузка

# LOADING_AUTHORIZATION
source: Authorization
cn: 授权
kk: Авторландыру
ru: Авторизация

# LOADING_FILE
source: Downloading {{file_name}}... {{downloaded_size}} from {{file_size}} Mb
cn: 正在加載 {{file_name}}...{{downloaded_size}}，共 {{file_size}} Mb
kk: {{file_size}} Мб-тан {{file_name}}... {{downloaded_size}} жүктеу
ru: Загрузка {{file_name}}... {{downloaded_size}} из {{file_size}} Мб

# LOADING_PROJECTS
source: Loading the library
cn: 加载库
kk: Кітапхананы жүктеу
ru: Загрузка библиотеки

# LOADING_SCENE_TEMPLATE
source: Loading scene template "{{name}}"...
cn: 正在加載場景模板 «{{name}}»...
kk: "{{name}}"... сахна шаблонын жүктеудемін
ru: Загружаю шаблон сцены «{{name}}»...

# LOADING_SERVER_INFO
source: Loading server information
cn: 加载服务器信息
kk: Сервер туралы ақпаратты жүктеу
ru: Загрузка информации о сервере

source: Loading workspaces
cn: 加载工作区
kk: Жұмыс кеңістіктерін жүктеу
ru: Загрузка рабочих пространств

# LOCK_CHILDREN
source: Lock hierarchy in play mode
cn: 在遊玩模式下鎖定層次結構
kk: Қарау режимінде иерархияны бекіту
ru: Зафиксировать иерархию в режиме просмотра

# LOCK_HIERARCHY_COMPONENT_TOOLTIP
source: Set the current object as the parent object for objects in the hierarchy. All descendants of the parent object are considered as one.
cn: 将当前对象设置为层次结构中对象的父对象。父对象的所有子对象被视为一个对象。
kk: Ағымдағы объектіні иерархиядағы объектілер үшін түпкі ретінде орнату. Түпкі объектінің барлық ұрпақтары біртұтас болып саналады.
ru: Установить текущий объект как родительский для объектов в иерархии. Все потомки родительского объекта считаются одним целым.

# LOCK_SELECTABILITY
source: Enable selection from scene
cn: 允許從場景中選擇
kk: Сахнадан ерекшелеуге рұқсат беру
ru: Разрешить выделение со сцены

# MAINMENU_ACTIVE_OPENXR_RUNTIME
source: Active OpenXR runtime
cn: 活動 OpenXR 運行時
kk: OpenXR орындау ортасы
ru: Среда выполнения OpenXR

# MAINMENU_AUTHORIZATION_TEXT
source: Enter your username and password to access workspaces
cn: 输入您的用户名和密码以访问工作区
kk: Жұмыс кеңістіктеріне кіру үшін пайдаланушының логині мен құпиясөзін енгізіңіз
ru: Введите логин и пароль пользователя для доступа к рабочим пространствам

# MAINMENU_AUTHORIZATION_TITLE
source: Authorization
cn: 授权
kk: Авторландыру
ru: Авторизация

# MAINMENU_CANCEL
source: Cancel
cn: 取消
kk: Бас тарту
ru: Отмена

# MAINMENU_CHANGEWORKSPACE
source: Change
cn: 改變
kk: Ауыстыру
ru: Сменить

# MAINMENU_CONNECT
source: Connect
cn: 連接
kk: Қосылу
ru: Подключиться

# MAINMENU_CONNECTING_TO_SERVER_TEXT
source: To access Varwin projects, enter the server IP address
cn: 要访问 Varwin 项目，请输入服务器 IP 地址
kk: Varwin жобаларына қол жеткізу үшін сервердің IP-мекенжайын енгізіңіз
ru: Для доступа к проектам Varwin введите IP-адрес сервера

# MAINMENU_CONNECTING_TO_SERVER_TITLE
source: Connecting to the server
cn: 连接到服务器
kk: Серверге қосылу
ru: Подключение к серверу

# MAINMENU_CONNECTING_XRMS_NO_PROJECT
source: There are no suitable projects in Varwin XRMS
kk: Varwin XRMS-те қолайлы жобалар жоқ
ru: В Varwin XRMS нет подходящих проектов

# MAINMENU_DELETE_PROJECT
source: Delete
cn: 刪除
kk: Жою
ru: Удалить

# MAINMENU_ENTER
source: Log In
cn: 入口
kk: Кіру
ru: Вход

# MAINMENU_IPINPUT
source: Enter the IP-address...
cn: 輸入ip地址...
kk: IP-мекенжай енгізіңіз...
ru: Введите ip-адрес...

# MAINMENU_LOCAL
source: Downloaded
cn: 已下载
kk: Жүктелгендер
ru: Загруженные

# MAINMENU_LOGIN
source: Login
cn: 登錄
kk: Логин
ru: Логин

# MAINMENU_LOGOUT
source: Logout
cn: 出去
kk: Шығу
ru: Выйти

# MAINMENU_MOBILE_VR_IS_NOT_AVAILABLE
source: Your Varwin license does not support VR mode. Contact your license provider.
cn: 您的 Varwin 許可證不支持 VR 模式。 請聯繫您的許可證提供商。
kk: Сіздің Varwin лицензияңыз VR режимін қолдамайды. Лицензия жеткізушісіне хабарласыңыз.
ru: Ваша лицензия Varwin не поддерживает VR режим. Обратитесь к вашему поставщику лицензии.

# MAINMENU_MULTIPLAYER
source: Multiplayer
cn: 多人遊戲
kk: Мультиплеер
ru: Мультиплеер

# MAINMENU_MULTIPLAYER_TEXT
source: The multiplayer mode is intended for joint testing of the project. To connect to the server, enter its IP address
cn: 多人模式旨在对项目进行联合测试。 要连接到服务器，请输入其 IP 地址
kk: Мультиплеер режимі жобаны бірлесіп тестілеуге арналған. Серверге қосылу үшін оның IP-мекенжайын енгізіңіз
ru: Режим мультиплеера предназначен для совместного тестирования проекта. Для подключения к серверу, введите его IP-адрес

# MAINMENU_NO_PROJECTS
source: No projects available
cn: 沒有項目
kk: Жобалар жоқ
ru: Нет проектов

# MAINMENU_NO_SAVED_PROJECTS
source: The list of loaded projects is empty. To work without Internet access, download projects from the “Server” tab
cn: 加载的项目列表为空。 要在没有 Internet 访问的情况下工作，请从“服务器”选项卡下载项目
kk: Жүктелген жобалардың тізімі бос. Интернетке кірусіз жұмыс істеу үшін "Сервер" қойындысынан жобаларды жүктеп алыңыз
ru: Список загруженных проектов пуст. Для работы без доступа к интернету загрузите проекты из вкладки “Сервер”

# MAINMENU_NO_SCENES
source: No scenes avaliable
cn: 場景不可用
kk: Қолжетімді сахналар жоқ
ru: Не доступных сцен

# MAINMENU_NOTIFICATION_RESTART_VR_MODE
source: Restart the client or change the display mode to apply the changes
cn: 重新啟動客戶端或更改顯示模式以套用更改
kk: Өзгерістерді қолдану үшін клиентті қайта іске қосыңыз немесе көрсету режимін өзгертіңіз
ru: Перезапустите клиент или смените режим отображения для применения изменений

# MAINMENU_OPENXR_SINGLEPASS
source: Single pass rendering
cn: 單次渲染
kk: Бір жүріспен визуалдау
ru: Визуализация за один проход

# MAINMENU_OPENXR_SINGLEPASS_WARNING
source: Warning! Some objects or scenes that are not adapted to this mode of operation may have rendering problems
cn: 警告！有些物件或場景不適用於 可能會出現渲染問題
kk: Назар аударыңыз! Осы жұмыс режиміне бейімделмеген кейбір объектілерді немесе сахналарды визуалдау қиын болуы мүмкін
ru: Внимание! У некоторых объектов или сцен, не адаптированных к данному режиму работы, могут возникнуть проблемы с визуализацией

# MAINMENU_PASSWORD
source: Password
cn: 密碼
kk: Құпиясөз
ru: Пароль

# MAINMENU_PLAYER_MOVE_TYPE
source: Move type
cn: 移動類型
kk: Орын ауыстыру типі
ru: Тип перемещения

# MAINMENU_POINTER_DIRECTION
source: Pointer direction
cn: 指標方向
kk: Көрсеткіш бағыты
ru: Направление указки

# MAINMENU_POINTER_DIRECTION_NATIVE
source: Default
cn: 預設
kk: Әдепкі
ru: По умолчанию

# MAINMENU_PROJECTS
source: Projects
cn: 項目
kk: Жобалар
ru: Проекты

# MAINMENU_REMEMBERME
source: Remember
cn: 記住
kk: Есте сақтау
ru: Запомнить

# MAINMENU_SAVE_PROJECT
source: Download
cn: 下載
kk: Жүктеу
ru: Скачать

# MAINMENU_SAVED_PROJECTS
source: Downloaded projects
cn: 下载的项目
kk: Жүктелген жобалар
ru: Загруженные проекты

# MAINMENU_SERVER
source: Server
cn: 服務器
kk: Сервер
ru: Сервер

# MAINMENU_UPDATED AT
source: Updated at
cn: 更新
kk: Жаңартылды
ru: Обновлено

# MAINMENU_VIGNETTE
source: Vignette
cn: 小插圖
kk: Виньетка
ru: Виньетка

# MAINMENU_VIGNETTE_MEDIUM
source: Medium
cn: 中等
kk: Орташа
ru: Средняя

# MAINMENU_VIGNETTE_OFF
source: Off
cn: 離開
kk: Өшірілді
ru: Выключена

# MAINMENU_VIGNETTE_STRONG
source: Strong
cn: 强
kk: Күшті
ru: Сильная

# MAINMENU_VIGNETTE_WEAK
source: Weak
cn: 弱
kk: Әлсіз
ru: Слабая

# MAINMENU_WORKSPACES
source: Workspaces
cn: 工作區
kk: Жұмыс кеңістігі
ru: Рабочее пространство

source: Menu
cn: 菜单
kk: Мәзір
ru: Меню

# MOBILE_READY_CHANGED
source: Mobile-VR support status is changed. Project will be reloaded.
cn: Mobile-VR 支持狀態已更改，項目將重新啟動。
kk: Mobile-VR қолдау статусы өзгертілді, жоба қайта іске қосылады.
ru: Статус поддержки Mobile-VR изменен, проект будет перезапущен.

source: Mode
cn: 模式
kk: Режим
ru: Режим

# MULTIPLAYER_BACK
source: Back
cn: 后退
kk: Артқа
ru: Назад

# MULTIPLAYER_CONNECT
source: Connect
cn: 连接
kk: Қосу
ru: Подключение

# MULTIPLAYER_CONNECTINGTOHOST
source: Connecting to host
cn: 主机连接
kk: Хостқа қосу
ru: Подключение к хосту

# MULTIPLAYER_CONNECTINGTOSESSION
source: Connecting to a session
cn: 连接到会话
kk: Сессияға қосу
ru: Подключение к сессии

# MULTIPLAYER_CONNECTION_ERROR_DESCRIPTION
source: Please check that the information you entered is correct and try again.
cn: 请检查您输入的信息是否正确，然后重试。
kk: Сіз енгізген деректердің дұрыстығын тексеріп, әрекетті қайталаңыз.
ru: Проверьте правильность введенных вами данных и повторите попытку

# MULTIPLAYER_CONNECTIONERROR
source: Connection error
cn: 连接错误
kk: Қосу қатесі
ru: Ошибка подключения

# MULTIPLAYER_DESKTOP
source: Desktop
cn: 桌面
kk: ДК
ru: ПК

# MULTIPLAYER_ENTERIPADDRESS
source: Enter server ip address
cn: 输入服务器地址
kk: IP-мекенжай енгізіңіз
ru: Введите IP адрес

# MULTIPLAYER_HOST_DISCONNECTED_BUTTON
source: Exit
cn: 出口
kk: Шығу
ru: Выход

# MULTIPLAYER_HOST_DISCONNECTED_MESSAGE
source: Host has been disconnected
cn: 主机已断开连接
kk: Хост өшірілген
ru: Хост был отключен

# MULTIPLAYER_HOST_IP
source: Server IP
cn: 服务器 IP
kk: Сервердің IP-мекенжайы
ru: IP-адрес сервера

# MULTIPLAYER_HOST_NAME
source: Server
cn: 服务器
kk: Сервер
ru: Сервер

# MULTIPLAYER_LISTOFPLAYERS
source: List of players
cn: 球员名单
kk: Ойыншылар тізімі
ru: Список игроков

# MULTIPLAYER_NETTLEDESK
source: Illumetry IO
kk: NettleDesk
ru: NettleDesk

# MULTIPLAYER_PLAYERS_NAME
source: Name
cn: 姓名
kk: Аты
ru: Имя

# MULTIPLAYER_PLAYERS_STATUS
source: Status
cn: 地位
kk: Статус
ru: Статус

# MULTIPLAYER_PLAYERS_STATUS_CONNECTING
source: Connecting
cn: 连接
kk: Қосу
ru: Подключение

# MULTIPLAYER_PLAYERS_STATUS_HOST
source: Host
cn: 主持人
kk: Хост
ru: Хост

# MULTIPLAYER_PLAYERS_STATUS_READY
source: Ready
cn: 准备好
kk: Дайын
ru: Готов

# MULTIPLAYER_PROJECTLOADING
source: Project loading
cn: 加载项目
kk: Жобаны жүктеу
ru: Загрузка проекта

# MULTIPLAYER_SELECT_GAMEMODE
source: Mode selection
cn: 模式选择
kk: Режим таңдау
ru: Выбор режима

# MULTIPLAYER_SESSION_CREATIION
source: Session creation
cn: 会话创建
kk: Сессия құру
ru: Создание сессии

# MULTIPLAYER_SPECTATOR
source: Spectator
cn: 观察者
kk: Қадағалаушы
ru: Наблюдатель

# MULTIPLAYER_STARTGAMEMODE
source: Start in mode
cn: 启动模式
kk: Режимде іске қосу
ru: Запуск в режиме

# MULTIPLAYER_STARTSESSION
source: Start
cn: 开始
kk: Іске қосу
ru: Запустить

# NETTLEDESK_STYLUS_SUPPORT
source: Stylus support
cn: 支持手写笔
kk: Стилусты қолдау
ru: Поддержка стилуса

source: No
cn: 不是
kk: Жоқ
ru: Нет

# NOT_FOR_COMMERCIAL_USE
source: Varwin demo-version. Please upgrade to Professional or Business edition to remove demo restriction.
cn: Varwin 的演示版。 請購買專業版或商業版以消除演示限制
kk: Varwin демо-нұсқасы. Демонстрациялық шектеулерді алып тастау үшін Professional немесе Business нұсқасын сатып алудыөтінеміз.
ru: Демо-версия Varwin. Пожалуйста, приобретите Professional или Business версию, чтобы снять демонстрационные ограничения.

# OBJECT_NAME
source: Object Type
cn: 物件類別
kk: Объектінің типі
ru: Тип объекта

# OBJECT_USE_IN_LOGIC
source: Object is included in logic. Do you want to delete it?
cn: 該對像用於邏輯。你想刪除它嗎？
kk: Объект логикада пайдаланылады. Оны жойғыңыз келе ме?
ru: Объект используется в логике. Хотите его удалить?

# OBJECT_VERSION_CHANGED
source: Object version was changed. Project restart is required.
cn: 對象的版本已更改，需要重新啟動項目。
kk: Объектілердің немесе сахна шаблондарының нұсқалары өзгертілді, жобаны қайта іске қосу қажет.
ru: Версии объектов или шаблона сцены были изменены, требуется перезапуск проекта.

# OBJECT_VERSION_WINDOW
source: Object version control
cn: 對象版本控制
kk: Объектілердің нұсқаларын басқару
ru: Управление версиями объектов

source: Object was copied
cn: 複製的對象
kk: Объектінің көшірмесі жасалды
ru: Объект скопирован

source: Object was duplicated
cn: 對象重複
kk: Объектінің дублі жасалды
ru: Объект дублирован

source: Object was pasted
cn: 插入的對象
kk: Объект салынды
ru: Объект вставлен

source: OK
cn: 好的
kk: ОК

source: Open console
cn: 開啟控制台
kk: Консольді ашу
ru: Открыть консоль

# OPEN_CONSOLE_FOR_MORE_INFO
source: For more detailed information, open the console
cn: 如需詳細資訊，請開啟主控台
kk: Толығырақ ақпарат алу үшін консольді ашыңыз
ru: Для получения более подробной информации откройте консоль

source: Open documentation
cn: 開放文獻資料
kk: Құжаттаманы ашу
ru: Открыть документацию

source: OpenXR Initialization
cn: 啟動 OpenXR
kk: OpenXR-ды іске қосу
ru: Запуск OpenXR

# PHOTON_DISCONECT
source: Multiplayer server disconnected
cn: 與多人服務器斷開連接
kk: Мультиплеерді серверден ажырату
ru: Отключение от сервера мультиплеера

# PIVOT_MODE_CENTER
source: Center
cn: 中心
kk: Центр
ru: Центр

# PIVOT_MODE_PIVOT
source: Pivot
cn: 錨點
kk: Тірек нүктесі
ru: Точка опоры

# PLATFORM_MODE
source: Display mode
cn: 显示模式
kk: Көрсету режимі
ru: Режим отображения

# PLATFORM_MODE_IS_NOT_AVAILABLE_TITLE
source: Mode {{platform_mode}} is not available
cn: 模式 {{platform_mode}} 不可用
kk: {{рlatform_mode}} режимі қол жетімді емес
ru: Режим {{platform_mode}} недоступен

# PLATFORM_MODE_IS_NOT_AVAILABLE_UNDER_LICENSE
source: Mode {{platform_mode}} is not available for this license. You need to change the mode in the project configuration
cn: 模式 {{platform_mode}} 不適用於此許可證。 您需要在項目配置中更改模式
kk: {{рlatform_mode}} режимі берілген лицензия үшін қол жетімді емес. Жоба конфигурациясында режимді өзгерту керек
ru: Режим {{platform_mode}} недоступен для данной лицензии. Необходимо изменить режим в конфигурации проекта

# PLAYER_MOVE_TYPE_LOCOMOTION
source: Locomotion
cn: 機芯運動
kk: Жылжу
ru: Передвижение

# PLAYER_MOVE_TYPE_TELEPORT
source: Teleport
cn: 瞬移
kk: Телепортация
ru: Телепортация

source: Position
cn: 座標
kk: Позиция
ru: Позиция

# PROJECT_CONFIG_ERROR
source: Error. Project configuration is not loaded
cn: 錯誤。未加載項目配置
kk: Қате. Жоба конфигурациясы жүктелген жоқ
ru: Ошибка. Конфигурация проекта не загружена

# PROJECT_CONFIG_NULL
source: Project configuration does not exist
cn: 世界配置不存在
kk: Әлем конфигурациясы жоқ
ru: Конфигурации мира не существует

# PROJECT_CONFIGURATION
source: Launch configuration
cn: 启动配置
kk: Іске қосу конфигурациясы
ru: Конфигурация запуска

# PROJECT_DOWNLOAD_ERROR
source: An error occurred while downloading project '{{project_name}}'
cn: 下载项目“{{project_name}}”时出错
kk: '{{project_name}}' жобасын жүктеу кезінде қате болды
ru: При загрузке проекта '{{project_name}}' произошла ошибка

# PROJECT_WAS_REMOVED
source: Current project was removed. The editor going to close now
cn: 當前項目已被刪除。編輯器將被關閉
kk: Ағымдағы жоба жойылды. Редактор жабылады
ru: Текущий проект был удален. Редактор будет закрыт

# PROPERTY_INSPECTOR
source: Properties
cn: 特性
kk: Қасиеттер
ru: Свойства

# READ_LAUNCH_ARGS_RABBIT_ERROR
source: Error. Server is unavailable
cn: 錯誤。服務器不可用
kk: Қате. Сервер қолжетімді емес
ru: Ошибка. Сервер недоступен

source: Refresh
cn: 刷新
kk: Жаңарту
ru: Обновить

source: Reload
cn: 重新加載
kk: Қайта жүктеу
ru: Перезагрузить

# REMOVED_OBJECTS_WARNING
source: One or more objects have been removed from the Varwin XRMS library. In order to save the scene data, please remove the missing objects from the scene
cn: 一个或多个对象已从 Varwin XRMS 库中删除。为了保存场景数据，请从场景中删除丢失的对象
kk: Varwin XRMS кітапханасынан бір немесе бірнеше объект жойылды. Сахна деректерін сақтау үшін, жоқ объектілерді сахнадан алып тастауды өтінеміз
ru: Один или несколько объектов были удалены из библиотеки Varwin XRMS. Для того, что бы сохранить данные сцены, пожалуйста, удалите отсутствующие объекты со сцены

# REMOVED_OBJECTS_WARNING_SUCCESS
source: All objects missing from the library have been removed. You can save the scene !
cn: 库中丢失的所有对象都已删除。您可以保存场景 ！
kk: Кітапханада жоқ объектілердің барлығы жойылды. Сахнаны сақтауыңызға болады!
ru: Все отсутствующие в библиотеке объекты были удалены. Вы можете сохранить сцену !

# REMOVED_RESOURCES_WARNING
source: The resources used in the scene have been removed from the Varwin XRMS library. Please change the values of the properties that use the missing resources.
cn: 场景中使用的资源已从 Varwin XRMS 库中删除。请更改使用丢失资源的属性值。
kk: Сахнада пайдаланылатын ресурстар Varwin XRMS кітапханасынан жойылды. Жоқ ресурстарды пайдаланатын қасиеттердің мәндерін өзгертуді өтінеміз.
ru: Используемые на сцене ресурсы были удалены из библиотеки Varwin XRMS. Пожалуйста, измените значения свойств, которые используют отсутстующие ресурсы.

# REMOVED_RESOURCES_WARNING_SUCCESS
source: Missing resources are no longer used in the scene. You can save the project !
cn: 场景中不再使用缺失的资源。您可以保存项目 ！
kk: Жоқ ресурстар енді сахнада пайдаланылмайды. Жобаны сақтауыңызға болады!
ru: Отсутствующие ресурсы больше не используются на сцене. Вы можете сохранить проект !

source: Reset changes
cn: 重置更改
kk: Өзгерістерді арылту
ru: Сбросить изменения

# RESOURCE_MISSING_AUDIO
source: Audio
cn: 聲音的
kk: Аудио
ru: Аудио

# RESOURCE_MISSING_BASE
source: Resources are not displayed because no standard objects found for resource reproduction:
cn: 資源不顯示，因為找不到用於復制資源的標準對象：
kk: Ресурстар көрсетілмейді, өйткені ресурстарды шығаратын стандартты объектілер табылған жоқ:
ru: Ресурсы не отображаются, т.к. не найдены стандартные объекты для воспроизведения ресурсов:

# RESOURCE_MISSING_IMAGE
source: Image
cn: 圖片
kk: Кескін
ru: Изображение

# RESOURCE_MISSING_MODEL
source: 3D Model
cn: 3D模型
kk: 3D Модель
ru: 3D Модель

# RESOURCE_MISSING_VIDEO
source: Video
cn: 視頻
kk: Видео
ru: Видео

# RESOURCE_SELECT_WINDOW
source: Select Resource
cn: 資源選擇
kk: Ресурс таңдау
ru: Выбор ресурса

source: Resources
cn: 資源
kk: Ресурстар
ru: Ресурсы

source: Resources not found.
cn: 未找到資源。
kk: Ресурстар табылған жоқ.
ru: Ресурсы не найдены.

# RESOURCES_OBJECTS
source: Resources in library
cn: 圖書館資源
kk: Кітапханадағы ресурстар
ru: Ресурсов в библиотеке

source: Return
cn: 返回
kk: Қайту
ru: Вернуться

# ROOM_CREATING
source: Creating room...
cn: 創建房間...
kk: Бөлме жасау...
ru: Создание комнаты...

source: Rotation
cn: 角度
kk: Бұрылыс
ru: Поворот

source: Runtime code error
cn: 邏輯執行錯誤
kk: Логиканы орындау қатесі
ru: Ошибка исполнения логики

source: Saturation
cn: 飽和
kk: Қанықтық
ru: Насыщенность

source: Save
cn: 節省
kk: Сақтау
ru: Сохранить

# SAVE_ERROR
source: Can't save
cn: 保存錯誤
kk: Сақтау қатесі
ru: Ошибка сохранения

source: Saved
cn: 已保存
kk: Сақталды
ru: Сохранено

source: Scale
cn: 縮放
kk: Масштаб
ru: Масштаб

# SCENE_LOADING
source: Scene template loading...
cn: 正在加載場景模板...
kk: Сахна шаблонын жүктеу...
ru: Загрузка шаблона сцены...

# SCENE_OBJECTS
source: Objects on scene
cn: 舞台上的物品
kk: Сахнадағы объектілер
ru: Объектов на сцене

# SCENE_OBJECTS_CHANGED
source: Scene was changed by another user. Do you want to save yours or reload to new version?
cn: 另一個用戶改變了場景。保留當前版本，還是使用新版本？
kk: Басқа пайдаланушы сахнаны өзгертті. Ағымдағы нұсқаны сақтау керек пе, әлде жаңасын пайдалану керек пе?
ru: Другой пользователь изменил сцену. Сохранить текущую версию, или использовать новую?

# SCENE_OBJECTS_HAVE_NOT_SAVED_BEHAVIOURS_CONSOLE
source: Some objects have different standard behaviors on the server and client side. Open the project in edit mode and try to save scene. Wrong objects: {0}
cn: 某些物件在伺服器端和用戶端有不同的標準行為。以編輯模式開啟專案，並嘗試儲存場景。錯誤的物件： {0}
kk: Кейбір объектілердің сервер мен клиент жағындағы стандартты әрекеттері әртүрлі. Жобаны редакторлау режимінде ашыңыз да, сахнаны сақтап көріңіз. Дұрыс емес объектілер: {0}
ru: Некоторые объекты имеют разные стандартные поведения на стороне сервера и клиента. Откройте проект в режиме редактирования и попробуйте сохранить сцену. Неправильные объекты: {0}

# SCENE_OBJECTS_HAVE_NOT_SAVED_BEHAVIOURS_POPUP
source: There are invalid objects in the scene. Open the console (press ~) to see a detailed description.
cn: 場景中有無效物件。開啟控制台（按 ~）查看詳細說明。
kk: Сахнада дұрыс емес объектілер бар. Толық сипаттаманы көру үшін консольді ашыңыз (~ батырмасын басыңыз).
ru: На сцене присутствуют некорректные объекты. Откройте консоль (нажмите ~), чтобы увидеть детальное описание.

# SCENE_OBJECTS_SAVED_AFTER_UPDATE
source: After updating the objects, the scene will be automatically saved
cn: 更新物件後，場景將自動儲存
kk: Объектілер жаңартылғаннан кейін сахна автоматты түрде сақталады
ru: После обновления объектов будет произведено автоматическое сохранение сцены

source: Scene preparation...
cn: 舞台準備...
kk: Сахнаны дайындау...
ru: Подготовка сцены...

# SCENE_SAVED
source: Scene saved successfully
cn: 場景保存成功
kk: Сахна сәтті сақталды
ru: Сцена успешно сохранена

# SCENE_TEMPLATE_CHANGED
source: Scene template was changed. Do you want to save and reload scene?
cn: 場景模板已更改。想要保存更改並重新加載場景？
kk: Сахна шаблоны өзгертілді. Өзгерістерді сақтап, сахнаны қайта жүктегіңіз келе ме?
ru: Шаблон сцены был изменен. Хотите сохранить изменения и перезагрузить сцену?

# SCENE_WAS_REMOVED
source: Current scene was removed. The editor going to close now
cn: 當前場景已被刪除。編輯器將被關閉
kk: Ағымдағы сахна жойылды. Редактор жабылады
ru: Текущая сцена была удалена. Редактор будет закрыт

source: Send report
cn: 發送報告
kk: Есеп жіберу
ru: Отправить отчет

# SET_MODE_SAVE_POPUP_MESSAGE
source: Do you want to save the changes made to the scene?
cn: 是否要保存對場景所做的更改？
kk: Сахнаға енгізілген өзгерістерді сақтағыңыз келе ме?
ru: Вы хотите сохранить изменения, внесенные в сцену?

source: Settings
cn: 设置
kk: Теңшеулер
ru: Настройки

source: Size
cn: 規模
kk: Өлшем
ru: Размер

# SOME_OBJECTS_IS_NOT_LINUX_READY_MESSAGE
source: Some objects or scene templates you are using do not have Linux support, please try updating to a supported version
cn: 您正在使用的某些對像或場景模板不支持 Linux，請嘗試更新到受支持的版本
kk: Кейбір пайдаланылатын объектілерде немесе сахна шаблондарында Linux қолдауы жоқ, оларды қолдау көрсетілетін нұсқаға дейін жаңартып көріңіз
ru: Некоторые используемые объекты или шаблоны сцен не имеют поддержки Linux, попробуйте обновить их до поддерживаемой версии

# SOME_OBJECTS_IS_NOT_LINUX_READY_TITLE
source: There is a problem
cn: 有一個問題
kk: Проблемалар бар
ru: Есть проблемы

# SPACE_MODE_LOCAL
source: Local
cn: 當地
kk: Локалды
ru: Локальная
