Repository: stanley-pilgrim/Isomers
Catalog: Assets/Varwin/Core/SmartLocalizationWorkspace/Data/LanguageData/Language.*.resx
Languages: cn, kk, ru

# SPACE_MODE_WORLD
source: World
cn: 世界
kk: Әлемдік
ru: Мировая

# SPAWN_PAID_WINDOW_CLOSE
source: Close
cn: 關閉
kk: Жабу
ru: Закрыть

# SPAWN_PAID_WINDOW_OPEN_LICENSES
source: More about licenses
cn: 有關許可證的更多信息
kk: Лицензиялар туралы толығырақ
ru: Подробнее о лицензиях

# SPAWN_PAID_WINDOW_TITLE
source: This object can only be used with paid Varwin licenses
cn: 此對像只能與付費的 Varwin 許可證一起使用
kk: Бұл объектіні ақылы Varwin лицензияларында ғана пайдалануға болады
ru: Этот объект можно использовать только на платных лицензиях Varwin

# SPAWN_POINT_ERROR
source: Player spawn point not found
cn: 未找到玩家起始位置
kk: Ойыншының старттық позициясы табылған жоқ
ru: Стартовая позиция игрока не найдена

# SPAWN_WITH_PARENT
source: Create new objects, assigning this object as parent
cn: 將此對象分配為父對象， 對於新創建的對象
kk: Бұл объектіні түпкі етіп тағайындау, құрылып жатқан жаңа объектілер үшін
ru: Назначать этот объект родительским, для новых создаваемых объектов

source: Steam VR Initialization
cn: 啟動 Steam VR
kk: Steam VR іске қосу
ru: Запуск Steam VR

# TOOLTIP_AR_MODE
source: Preview in AR
cn: 在 AR 中預覽
kk: AR-да алдын ала қарау
ru: Предпросмотр в AR

# TOOLTIP_COLLIDER_VISUALIZATION_EDGES
source: Change collider visualization mode [Ctrl-Alt-C] Edges only
cn: 更改碰撞器的顯示模式 [Ctrl-Alt-C] 僅顯示邊
kk: Коллайдерлердің көрсету режимін өзгерту [Ctrl-Alt-C] Тек қырлар
ru: Изменить режим отображения коллайдеров [Ctrl-Alt-C] Только грани

# TOOLTIP_COLLIDER_VISUALIZATION_NONE
source: Change collider visualization mode [Ctrl-Alt-C] No collider visualization
cn: 更改碰撞器的顯示模式 [Ctrl-Alt-C] 不顯示碰撞器
kk: Коллайдерлердің көрсету режимін өзгерту [Ctrl-Alt-C] Коллайдерлерді визуалдаусыз
ru: Изменить режим отображения коллайдеров [Ctrl-Alt-C] Без визуализации коллайдеров

# TOOLTIP_COLLIDER_VISUALIZATION_SOLID
source: Change collider visualization mode [Ctrl-Alt-C] Edges and faces
cn: 更改碰撞器的顯示模式 [Ctrl-Alt-C] 顯示邊和面
kk: Коллайдерлердің көрсету режимін өзгерту [Ctrl-Alt-C] Жазықтықтар
ru: Изменить режим отображения коллайдеров [Ctrl-Alt-C] Плоскости

# TOOLTIP_COPY
source: Copy [Ctrl-C]
cn: 複製 [Ctrl-C]
kk: Көшірме жасау [Ctrl-C]
ru: Копировать [Ctrl-C]

# TOOLTIP_DESKTOP_PLAYER_MODE
source: Preview on desktop
cn: 電腦預覽
kk: ДК-да алдын ала қарау
ru: Предпросмотр на ПК

# TOOLTIP_DOCUMENTATION_LINK
source: Open documentation link
cn: 打开文档链接
kk: Құжаттамаға сілтемені ашу
ru: Открыть ссылку на документацию

# TOOLTIP_HAND_TOOL
source: Hand Tool [Q]
cn: 視角移動 [Q]
kk: Камераның орнын ауыстыру [Q]
ru: Перемещение камеры [Q]

# TOOLTIP_MOVE_TOOL
source: Move Tool [W]
cn: 移動工具 [W]
kk: Камераның орнын ауыстыру [W]
ru: Перемещение объекта [W]

# TOOLTIP_NETTLEDESK_MODE
source: Preview on Illumetry IO mode
cn: 在 VR 中預覽
kk: NettleDesk-те алдын ала қарау
ru: Предпросмотр в NettleDesk

# TOOLTIP_PASTE
source: Paste [Ctrl-V]
cn: 粘貼 [Ctrl-V]
kk: Қою [Ctrl-V]
ru: Вставить [Ctrl-V]

# TOOLTIP_PIVOT_MODE_CENTER
source: Toggle Tool Handle Position [Z] The tool handle is placed at the center of the selection.
cn: 更改工具的參考點位置 [Z] 工具的參考點以物件的中心點為基準
kk: Айналу нүктесін өзгерту [Z] Объект өз центрін айналады.
ru: Изменить точку вращения [Z] Объект вращается вокруг своего центра.

# TOOLTIP_PIVOT_MODE_PIVOT
source: Toggle Tool Handle Position [Z] The tool handle is placed at the active object's pivot point.
cn: 更改工具的參考點位置 [Z] 工具的參考點以物件從2D或3D繪圖軟體匯出時預設的參考點為基準
kk: Айналу нүктесін өзгерту [Z] Объект өз тірек нүктесін айналады.
ru: Изменить точку вращения [Z] Объект вращается вокруг точки опоры.

# TOOLTIP_REDO
source: Redo [Ctrl-Y]
cn: 重複 [Ctrl-Y]
kk: Қайталау [Ctrl-Y]
ru: Повторить [Ctrl-Y]

# TOOLTIP_ROTATE_TOOL
source: Rotate Tool [E]
cn: 旋轉工具 [E]
kk: Объектінің айналуы [E]
ru: Вращение объекта [E]

# TOOLTIP_SAVE
source: Save [Ctrl-S]
cn: 儲存 [Ctrl-S]
kk: Сақтау [Ctrl-S]
ru: Сохранить [Ctrl-S]

# TOOLTIP_SCALE_TOOL
source: Scale Tool [R]
cn: 縮放工具 [R]
kk: Объектіні масштабтау [R]
ru: Масштабирование объекта [R]

# TOOLTIP_UNDO
source: Undo [Ctrl-Z]
cn: 取消 [Ctrl-Z]
kk: Бас тарту [Ctrl-Z]
ru: Отменить [Ctrl-Z]

# TOOLTIP_VERSION_CONTROL
source: Object version control window
cn: 對象版本控制窗口
kk: Объект нұсқаларын басқару терезесі
ru: Окно управления версиями объектов

# TOOLTIP_VR_MODE
source: Preview in VR
cn: 在 VR 中預覽
kk: VR-да алдын ала қарау
ru: Предпросмотр в VR

# TOOLTIP_WORLD_MODE_GLOBAL
source: Toggle Tool Handle Rotation [X] Tool handles are in global rotation.
cn: 啟用移動工具坐標軸旋轉 [X] 移動工具的坐標軸與場景坐標一致
kk: Санау жүйесін ауыстырып қосу [X] Объектінің сахна осьтеріне қатысты қозғалысы.
ru: Переключить систему отсчета [X] Движение объекта относительно осей сцены.

# TOOLTIP_WORLD_MODE_LOCAL
source: Toggle Tool Handle Rotation [X] Tool handles are in the active object's rotation.
cn: 啟用移動工具坐標軸旋轉 [X] 移動工具的坐標軸方向根據物件本身角度旋轉
kk: Санау жүйесін ауыстырып қосу [X] Объектінің оның осьтеріне қатысты қозғалысы.
ru: Переключить систему отсчета [X] Движение объекта относительно его осей.

source: Transform
cn: 參數
kk: Параметрлер
ru: Параметры

source: Try again
cn: 重複
kk: Қайталау
ru: Повторить

# TRY_TO_CONNECT_TO_RANDOM_ROOM
source: Trying to connect to random room...
cn: 正在嘗試連接到隨機房間...
kk: Кездейсоқ бөлмеге қосылып көру...
ru: Попытка соединения со случайной комнатой...

# TYPE_ARRAY
source: Array of elements of type {0}
cn: 数组 元素 类型 {0}
kk: {0} типті элементтер массиві
ru: Массив элементов типа {0}

# TYPE_BOOLEAN
source: Logical type
cn: 逻辑 类型
kk: Логикалық тип
ru: Логический тип

# TYPE_COLOR
source: Color
cn: 色彩
kk: Түр-түс
ru: Цвет

# TYPE_DOUBLE
source: Fractional number
cn: 分数 数字
kk: Бөлшек сан
ru: Дробное число

# TYPE_INTEGER
source: Whole number
cn: 全數
kk: Бүтінсанды тип
ru: Целочисленный тип

# TYPE_LIST
source: List of elements of type {0}
cn: 列表 的 元素 的 类型 {0}
kk: {0} типті элементтер тізімі
ru: Список элементов типа {0}

# TYPE_NULL
source: null
cn: 空
kk: null бос типі
ru: Пустой тип null

# TYPE_STRING
source: string
cn: 細繩
kk: жол типі
ru: Строковый тип

# TYPE_VECTOR
source: Vector
cn: 向量
kk: Вектор
ru: Вектор

# TYPE_WRAPPER
source: Object
cn: 物件
kk: Объект
ru: Объект

source: Unknown error
cn: 未知錯誤
kk: Белгісіз қате
ru: Неизвестная ошибка

# UNLINK_PARENT
source: Unparent object
cn: 解除綁定父對象
kk: Түпкі объектіні шешу
ru: Отвязать родительский объект

# VALIDATE_METHOD_EXCEPTION
source: The argument <Color=lightblue>{0}</Color> expects type: <Color=lightblue>{1}</Color>, and <Color=red>{2} ({3}) is passed.</Color> To fix the error, change the argument value.
kk: <Color=lightblue>{0}</Color> аргументі мына: <Color=lightblue>{1}</Color> типті күтеді, ал берілгені <Color=red>{2} ({3}).</Color> Қатені түзету үшін аргументтің мәнін өзгертіңіз.
ru: Аргумент <Color=lightblue>{0}</Color> ожидает тип: <Color=lightblue>{1}</Color>, а передан <Color=red>{2} ({3}).</Color> Чтобы исправить ошибку, измените значение аргумента.

# VERSION_CHANGE_UNSAVED
source: When you change version of an object or a scene template, all unsaved changes will be lost
cn: 當您更改場景模闆對象的版本時，所有未保存的更改都將丟失
kk: Объект нұсқаларын немесе сахна шаблондарын өзгерткен жағдайда барлық сақталмаған өзгерістер жоғалады
ru: При изменении версий объектов или шаблонов сцен все несохраненные изменения будут утеряны

source: Warning
cn: 警告
kk: Ескерту
ru: Предупреждение

source: Wrong login or password
cn: 登录名或密码错误
kk: Қате логин немесе құпиясөз
ru: Неверный логин или пароль

source: Yes
cn: 是的
kk: Иә
ru: Да

# YOU_CAN_GO_TO_PREVIEW_MODE
source: You can also switch to <link="set_dp_mode"><b><u>PC preview mode</u></b></link>.
cn: 您也可以切换到 <link="set_dp_mode"><b><u>PC 预览模式</u></b></link>。
kk: Сіз сондай-ақ <link="set_dp_mode"><b><u>-да ДК-да алдын ала қарау </u></b></link> режиміне ауыса аласыз.
ru: Вы также можете переключиться в <link="set_dp_mode"><b><u>режим предпросмотра на ПК</u></b></link>.

# MULTIPLAYER_VR
source: VR
cn: 虚拟现实
