Repository: stanley-pilgrim/Isomers
Catalog: Assets/Varwin/Core/SmartLocalizationWorkspace/Data/LanguageData/Language.*.resx
Languages: cn, kk, ru

source: Actions
cn: 行動
kk: Әрекеттер
ru: Действия

# ARRAY_ELEMENT
source: Element
cn: 元素
kk: Элемент
ru: Элемент

# BACKUP_LOCALIZATION_STRING
source: The scene has been restored from the change history. The client will be restarted
cn: 場景已從變更歷史中恢復。 客戶端將重新啟動
kk: Сахна өзгерістер тарихынан қалпына келтірілді. Клиент қайта жүктеледі
ru: Сцена была восстановлена из истории изменений. Клиент будет перезагружен

# BLOCK_ACTION_PREFIX
source: do
cn: 執行
kk: орындау
ru: выполнить

# BLOCK_EVENT_PREFIX
source: do on:
cn: 當事件發生:
kk: оқиғаға орындау:
ru: выполнить на событие:

# BLOCK_FUNCTION_PREFIX
source: do
cn: 執行
kk: орындау
ru: выполнить

# BLOCK_GETTER_PREFIX
source: get from object
cn: 取得
kk: объектіден алу
ru: получить от объекта

# BLOCK_SETTER_PREFIX
source: set
cn: 設定
kk: орнату
ru: установить

source: Brightness
cn: 亮度
kk: Жарықтық
ru: Яркость

# BUTTON
source: Simple Button
cn: 簡單的按鈕
kk: Қарапайым батырма
ru: Простая кнопка

# CAMERA_SETTINGS_LABEL
source: Smooth camera
cn: 相機平滑
kk: Камераны тегістеу
ru: Сглаживание камеры

source: Cancel
cn: 取消
kk: Бас тарту
ru: Отмена

# CANNOT_NOT_PREVIEW
source: Can't do it in preview mode
cn: 這在預覽模式下是不可能的。
kk: Алдын ала қарау режимінде бұл мүмкін емес
ru: Это невозможно в режиме предпросмотра

# CHOOSE_PARENT
source: Choose a parent object
cn: 分配父對象
kk: Түпкі объектіні тағайындау
ru: Назначить родительский объект

# CHOOSE_PROJECT_CONFIG
source: Choose project configuration
cn: 選擇世界配置
kk: Әлем конфигурациясын таңдаңыз
ru: Выберите конфигурацию мира

# CLIENT_TERMINATE
source: The editor going to close now. Do you want to save changes?
cn: 編輯器將被關閉。是否要保存更改？
kk: Редактор жабылады. Өзгерістерді сақтағыңыз келе ме?
ru: Редактор будет закрыт. Хотите сохранить изменения?

# CLOSE_APP
source: Close the application?
cn: 关闭应用程序？
kk: Қолданбаны жабу керек пе?
ru: Закрыть приложение?

# CLOSE_BUTTON
source: Close
cn: 關閉
kk: Жабу
ru: Закрыть

# COLLIDER_VISUALIZATION_EDGES
source: Edges
cn: 邊
kk: Қырлар
ru: Грани

# COLLIDER_VISUALIZATION_NONE
source: None
cn: 無
kk: Жоқ
ru: Нет

# COLLIDER_VISUALIZATION_SOLID
source: Solid
cn: 立體
kk: Жазықтықтар
ru: Плоскости

# COLOR_PICKER_WINDOW
source: Color Picker
cn: 顏色選擇
kk: Түр-түсті таңдау
ru: Выбор цвета

# COMPILE_CODE_ERROR
source: Compilation error
cn: 編譯錯誤
kk: Компиляция қатесі
ru: Ошибка компиляции

source: Connecting...
cn: 化合物...
kk: Қосу...
ru: Соединение...

# CONNECTION_ERROR
source: Connection lost, try connecting again
cn: 连接丢失，请尝试重新连接
kk: Қосылыс жоғалды, қайтадан қосылып көріңіз
ru: Соединение потеряно, попробуйте повторить подключение

source: Controller emulation
cn: 控制器仿真
kk: Контроллерді эмуляциялау
ru: Эмуляция контроллеров

# CURRENT_SCENE_TEMPLATE_DELETED
source: Current scene template was deleted
cn: 當前場景模板已被刪除
kk: Сахнаның ағымдағы шаблоны жойылды
ru: Текущий шаблон сцены был удален

# DELETE_OBJECT
source: Delete
cn: 刪除
kk: Жою
ru: Удалить

source: Disabled
cn: 禁用
kk: Ағытылған
ru: Отключена

# DISPLAY
source: Simple Display
cn: 簡單的展示
kk: Қарапайым дисплей
ru: Простой дисплей

source: Enable in Blockly Editor
cn: 在 Blockly 中使用
kk: Blockly-де пайдалану
ru: Использовать в Blockly

# ENTER_ROOM
source: Entering room...
cn: 進入房間...
kk: Бөлмеге кіру...
ru: Вход в комнату...

# ENVIRONMENT_ERROR
source: Environment setup error
cn: 環境設置錯誤
kk: Қоршаған ортаны теңшеу қатесі
ru: Ошибка настройки окружения

# ENVIRONMENT_NOT_FOUND
source: Error. Scene template not found
cn: 錯誤。未加載場景模板
kk: Қате. Сахна шаблоны жүктелген жоқ
ru: Ошибка. Шаблон сцены не загружен

# ERROR_API_CLIENT_VERSION_MISMATCH
source: Error. The RMS and client versions do not match. RMS Version '{{rms_version}}', Client Version '{{client_version}}'
cn: 错误。 RMS 和客户端版本不匹配。 RMS 版本“{{rms_version}}”，客户端版本“{{client_version}}”
kk: Қате. RMS және клиент нұсқалары сәйкес емес. RMS нұсқасы '{{rms_version}}', клиент нұсқасы '{{client_version}}'
ru: Ошибка. Версии RMS и клиента не совпадают. Версия RMS '{{rms_version}}', версия клиента '{{client_version}}'

# ERROR_CANT_CLONE_A_CLONED_OBJECT
source: The object '{{object_name}}' cannot be cloned because it is itself a clone.
cn: 物體 '{{object_name}}' 無法克隆，因為它本身就是克隆。
kk: '{{object_name}}' объектісін клондау мүмкін емес, өйткені оның өзі клон.
ru: Объект «{{object_name}}» нельзя клонировать, поскольку он сам является клоном.

# ERROR_CANT_CLONE_AT_POSITION_TYPE_MISMATCH
source: Cannot clone '{{object_name}}' to the given position because an object of the wrong type '{{type}}' was passed in the position value and '{{need_type}}' was expected.
cn: 無法克隆 '{{object_name}}' 到給定位置，因為物件類型錯誤 '{{type}}' 被傳遞到位置值並且 '{{need_type}}' was expected.
kk: '{{object_name}}' объектісін берілген позицияға клондау мүмкін емес, өйткені позиция мәнінде '{{type}}' қате типті объект берілген, ал күтілетіні -'{{need_type}}'.
ru: Невозможно склонировать '{{object_name}}' в заданную позицию, так как в значении позиции был передан объект неверного типа '{{type}}', а ожидается '{{need_type}}'.

# ERROR_CANT_CLONE_EMBEDDED_OBJECT
source: The object '{{object_name}}' cannot be cloned because it is embedded in the scene.
cn: 物體 '{{object_name}}' 無法克隆，因為它嵌入在場景中。
kk: '{{object_name}}' объектісін клондау мүмкін емес, өйткені ол сахнаға кіріктірілген.
ru: Объект «{{object_name}}» невозможно клонировать, поскольку он встроен в сцену.

# ERROR_CANT_CLONE_TYPE_MISMATCH
source: Cannot clone because incorrect type '{{type}}' was passed and 'object' was expected.
cn: 由於類型不正確而無法克隆 '{{type}}' 被通過並且 'object' 是預料之中的。
kk: Клондау мүмкін емес, өйткені '{{type}}' қате типі жіберілген, ал күтілетіні 'object'.
ru: Невозможно склонировать, так как передан неверный тип '{{type}}', а ожидается 'объект'.

# ERROR_CANT_CLONE_UNCLONABLE_OBJECT
source: The object '{{object_name}}' cannot be cloned because it is unclonable.
cn: 物體 '{{object_name}}' 無法克隆，因為它是不可克隆的。
kk: '{{object_name}}' объектісін клондау мүмкін емес, өйткені ол клондалмайтын объект болып табылады.
ru: Объект «{{object_name}}» нельзя клонировать, так как он является неклонируемым.

# ERROR_DESKTOP_POPUP_MESSAGE
source: A logic/object error has occurred. Possible instability of the project
cn: 發生邏輯/對象錯誤。 項目可能不穩定
kk: Логикада/объектіде қате болды. Жобаның тұрақсыз жұмыс істеуі мүмкін
ru: Произошла ошибка в логике/объекте. Возможна нестабильная работа проекта

# ERROR_DESTROY_CLONE_IS_NOT_CLONE
source: The object "{{object_name}}" cannot be deleted because it is not a clone.
cn: 物體 "{{object_name}}" 無法刪除，因為它不是克隆。
kk: "{{object_name}}" объектісін жою мүмкін емес, өйткені ол клон емес.
ru: Объект «{{object_name}}» невозможно удалить, так как он не является клоном.

# ERROR_DESTROY_CLONE_OBJECT_NOT_EXISTS
source: The object you are trying to destroy does not exist.
cn: 您嘗試銷毀的物件不存在。
kk: Сіз жоймақ болған нысан жоқ.
ru: Объект, который вы пытаетесь уничтожить, не существует

# ERROR_DESTROY_CLONE_TYPE_MISMATCH
source: The clone cannot be deleted because the wrong type '{{type}}' was passed and 'object' was expected.
cn: 由於類型錯誤，克隆無法刪除 '{{type}}' 被通過並且 'object' 是預料之中的。
kk: Клонды жою мүмкін емес, өйткені '{{type}}' қате типі жіберілген, ал күтілгені 'object'.
ru: Невозможно удалить клон, так как передан неверный тип '{{type}}', а ожидается 'объект'.

# ERROR_DESTROY_CLONES_IS_NOT_ORIGINAL
source: The object "{{object_name}}" cannot be deleted because it is not the original cloning object.
cn: 物體 "{{object_name}}" 無法刪除，因為它不是原始克隆物件。
kk: "{{object_name}}" объектісін жою мүмкін емес, себебі ол клондау түпнұсқасы емес.
ru: Объект «{{object_name}}» невозможно удалить, поскольку он не является оригиналом клонирования.

# ERROR_DESTROY_CLONES_TYPE_MISMATCH
source: Cannot delete object clones because the wrong type '{{type}}' was passed and 'object' was expected.
cn: 無法刪除物件克隆，因為類型錯誤 '{{type}}' 被通過並且 'object' 是預料之中的。
kk: Объектінің клондарын жою мүмкін емес, өйткені '{{type}}' қате типі жіберілген, ал күтілетіні - 'object'.
ru: Невозможно удалить клоны объекта, так как передан неверный тип '{{type}}', а ожидается 'объект'.

# ERROR_GET_CLONES_IS_NOT_ORIGINAL
source: Cannot list clones of object '{{object_name}}' because it is not the original object.
cn: 無法列出物件的克隆 '{{object_name}}' 因為它不是原始物件。
kk: '{{object_name}}' объектісінің клондарының тізімін алу мүмкін емес, өйткені ол түпнұсқа объект емес.
ru: Невозможно получить список клонов объекта «{{object_name}}», так как он не является оригинальным объектом.

# ERROR_GET_CLONES_TYPE_MISMATCH
source: Unable to get a list of object clones because the wrong type '{{type}}' was passed and 'object' was expected.
cn: 由於類型錯誤，無法取得物件克隆列表 '{{type}}' 被通過並且 'object' 是預料之中的。
kk: Объект клондарының тізімін алу мүмкін емес, өйткені '{{type}}' қате типі жіберілген, күтілетіні - 'object'.
ru: Невозможно получить список клонов объекта, так как передан неверный тип '{{type}}', а ожидается 'объект'.

# ERROR_GET_SERVER_CONFIG
source: Error receiving configuration from the server.
cn: 错误 接收 配置 从 服务器.
kk: Серверден конфигурацияны алу қатесі.
ru: Ошибка получения конфигурации от сервера. Попробуйте проверить: 1. Наличие подключения к интернету 2. Проверьте настройки прокси на вашем ПК

# ERROR_IS_CLONE_TYPE_MISMATCH
source: It is not possible to determine whether the object is a clone because the wrong type '{{type}}' was passed and 'object' was expected.
cn: Unable to determine whether the object is a copy object due to type error '{{type}}' 被通過並且 'object' 是預料之中的。
kk: Объектінің клон екенін-еместігін анықтау мүмкін емес, өйткені '{{type}}' қате типі берілген, ал күтілетіні - 'object'.
ru: Невозможно определить является ли объект клоном, так как передан неверный тип '{{type}}', а ожидается 'объект'.

# ERROR_IS_DESTROYED_TYPE_MISMATCH
source: It is not possible to determine whether the object is destroyed because the wrong type '{{type}}' was passed and 'object' was expected.
cn: 無法確定物件是否已被銷毀，因為傳遞了錯誤的類型“{{type}}”並且預期為“物件”。
kk: Объектінің жойылған-жойылмағанын анықтау мүмкін емес, өйткені '{{type}}' қате типі берілген, ал күтілетіні - 'object'.
ru: Невозможно определить уничтожен ли объект, так как передан неверный тип '{{type}}', а ожидается 'объект'.

# ERROR_LIST_IS_EMPTY
source: List is empty.
cn: 清單為空。
kk: Тізім бос.
ru: Список пуст.

# ERROR_LIST_OUT_OF_RANGE
source: Index [{{current_index}}] is out of range. List length: [{{array_length}}].
cn: 索引 [{{current_index}}] 超出範圍。清單長度：[{{array_length}}]。
kk: [{{current_index}}] индексі [{{array_length}}] тізімінің ұзындығынан үлкен.
ru: Индекс [{{current_index}}] больше, чем длина списка [{{array_length}}].

# ERROR_LIST_WRONG_INDEX_TYPE
source: Wrong index type. Provided index type: {{index_type}}. Required index type: integer.
cn: 錯誤的索引類型。已提供索引類型： {{index_type}}. 必須的索引類型：整數。
kk: Қате индекс типі. Берілген индекс типі: {{index_type}}. Қажетті индекс типі: бүтін сан.
ru: Предоставленный тип индекса: {{index_type}}. Требуемый тип индекса: целое число.

# ERROR_LIST_WRONG_TYPE
source: Wrong type of variable. Provided type is {{provided_type}}. Required type is {{required_type}}
cn: 變數類型錯誤。提供類型 是 {{provided_type}}。必填類型為 {{required_type}}
kk: Айнымалының қате типі. Берілген тип - {{provided_type}}. Қажетті тип - {{required_type}}.
ru: Предоставленный тип - {{provided_type}}. Требуемый тип - {{required_type}}.

# ERROR_LOCAL_SERVER_CONNECTION
source: <b>Error connecting to local server.</b> Please check the proxy settings on your PC. If a proxy server is used, add localhost and 127.0.0.1 addresses to the ignore list.
cn: <b>错误 连接 到 本地 服务器。</b> 請檢查電腦上的代理設定。如果使用代理伺服器，請將 localhost 和 127.0.0.1 位址新增至忽略清單。
kk: <b>Локалдық серверге қосылу қатесі.</b> Сіздің ДК-дағы прокси теңшеулерін тексеруді өтінеміз. Егер прокси сервер пайдаланылса, localhost және 127.0.0.1 мекенжайларын еленбейтін тізімдерге қосыңыз.
ru: <b>Ошибка подключения к локальному серверу.</b> Проверьте, пожалуйста, настройки прокси на вашем ПК. Если используется прокси сервер, добавьте адреса localhost и 127.0.0.1 в список игнорируемых.

# ERROR_LOCAL_SERVER_PARSE_CONFIG
source: <b>Incorrect response from the local server. </b> Please check the proxy settings on your PC. If you are using a proxy server, add localhost and 127.0.0.1 to the ignore list.
cn: <b>本地服務器響應不正確。 </b> 請檢查電腦上的代理設定。如果您使用的是代理伺服器，請在忽略清單中新增 localhost 和 127.0.0.1。
kk: <b>Локалдық серверден қате жауап. </b> Сіздің ДК-дағы прокси теңшеулерін тексеруді өтінеміз. Егер прокси сервер пайдаланылса, localhost және 127.0.0.1 мекенжайларын еленбейтін тізімдерге қосыңыз.
ru: <b>Некорректный ответ от локального сервера. </b> Проверьте, пожалуйста, настройки прокси на вашем ПК. Если используется прокси сервер, добавьте адреса localhost и 127.0.0.1 в список игнорируемых.

# ERROR_POPUP_MESSAGE
source: A logic/object error has occurred. Possible instability of the project
cn: 發生邏輯/對象錯誤。 項目可能不穩定
kk: Логикада/объектіде қате болды. Жобаның тұрақсыз жұмыс істеуі мүмкін
ru: Произошла ошибка в логике/объекте. Возможна нестабильная работа проекта

# ERROR_POPUP_TITLE
source: Something went wrong
cn: 出问题了
kk: Бірдеңе дұрыс болмады
ru: Что-то пошло не так

# ERROR_PROJECT_LAUNCH
source: An error occurred while starting the project. Perhaps the project files were corrupted or loaded with an error
cn: 启动项目时发生错误。 项目文件可能已损坏或加载时出现错误
kk: Жобаны іске қосу кезінде қате болды. Жоба файлдары бүлінген немесе қате жүктелген болуы мүмкін
ru: При запуске проекта произошла ошибка. Возможно файлы проекта были испорчены или загружены с ошибкой

# ERROR_READ_STARTUP_ARGS
source: Error. Can't read command line arguments
cn: 無法讀取啟動參數
kk: Қате. Старттық параметрлерді оқу мүмкін емес
ru: Невозможно прочесть стартовые параметры

# ERROR_REMOTE_SERVER_CONNECTION
source: <b>Error connecting to the remote server.</b> Check, please: 1. The server address and port are specified correctly (in the XRMS "Servers" settings) 2. Availability of a Varwin Server Edition license on the server 3. Availability of Internet connection 4. The port being used is open for external connections
cn: <b>連接遠端伺服器時發生錯誤。</b> 請核對： 1. 正確指定了伺服器位址和連接埠（在 XRMS "伺服器 "設定中） 2. 伺服器上是否有 Varwin 伺服器版許可證 3. 網路連線的可用性 4. 端口 正在使用 是 打开 为 外部 连接
kk: <b>Қашықтағы серверге қосылу қатесі.</b> Тексеруді өтінеміз: 1. Сервердің мекенжайы мен порты дұрыс көрсетілгенін (XRMS "Серверлер" теңшеулерінде) 2. Серверде Varwin Server Edition лицензиясының болуын 3. Интернет қосылымының болуын 4. Пайдаланылатын порт сыртқы қосылыстар үшін ашық екенін
ru: <b>Ошибка подключения к удаленному серверу.</b> Проверьте, пожалуйста: 1. Адрес и порт сервера указаны корректно (в настройках XRMS "Серверы") 2. Наличие лицензии Varwin Server Edition на сервере 3. Наличие подключения к интернету 4. Используемый порт открыт для внешних подключений

# ERROR_REMOTE_SERVER_PARSE_CONFIG
source: <b>Incorrect response from the remote server. </b> Check, please: 1. The server address and port are specified correctly (in the XRMS "Servers" settings) 2. Availability of a Varwin Server Edition license on the server 3. Availability of Internet connection
cn: <b>遠端伺服器的回應不正確。 </b> 請核對： 1. 正確指定了伺服器位址和連接埠（在 XRMS "伺服器 "設定中） 2. 伺服器上是否有 Varwin 伺服器版許可證 3. 網路連線的可用性
kk: <b>Қашықтағы серверден қате жауап. </b> Тексеруді өтінеміз: 1. Сервердің мекенжайы мен порты дұрыс көрсетілгенін (XRMS "Серверлер" теңшеулерінде) 2. Серверде Varwin Server Edition лицензиясының болуын 3. Интернет қосылымының болуын
ru: <b>Некорректный ответ от удаленного сервера. </b> Проверьте, пожалуйста: 1. Адрес и порт сервера указаны корректно (в настройках XRMS "Серверы") 2. Наличие лицензии Varwin Server Edition на сервере 3. Наличие подключение к интернету

# ERROR_SERVER_DISCONNECT
source: Error. Server is offline
cn: 錯誤。服務器沒有響應
kk: Қате. Сервер жауап бермейді
ru: Ошибка. Сервер не отвечает

# ERROR_TITLE
source: Error
cn: 错误
kk: Қате
ru: Ошибка

# ERROR_VR_POPUP_MESSAGE
source: Remove the headset and look at the error in the editor on the PC
cn: 摘下耳機，在PC端看編輯器報錯
kk: Шлемді шешіп, ДК редакторында қатені қараңыз
ru: Снимите шлем и посмотрите ошибку в редакторе на ПК

# ERRORS_ERROR_IN_METHOD
source: Error: <color=lightblue>{0}</color>. The argument <color=lightblue>{1}</color> expects <color=lightblue>{2}</color>, but is passed <color=red>{3}</color> with the value <color=red>{4 }</color>
cn: 错误： <color=lightblue>{0}</color>。 論點 <color=lightblue>{1}</color> expects <color=lightblue>{2}</color>, 但通過了 <color=red>{3}</color> 帶值 <color=red>{4 }</color>
kk: Қате: <color=lightblue>{0}</color>. <color=lightblue>{1}</color> аргументінің күтетіні <color=lightblue>{2}</color>, ал <color=red>{4}</color> мәнімен <color=red>{3}</color> берілген
ru: Ошибка: <color=lightblue>{0}</color>. Аргумент <color=lightblue>{1}</color> ожидает <color=lightblue>{2}</color>, а передан <color=red>{3}</color> со значением <color=red>{4}</color>

# ERRORS_ERROR_IN_SETTER
source: Error: <color=lightblue>{0}</color> Required type: <Color=lightblue>{1}</Color>. Provided type: <Color=red>{2}</Color>. To resolve the error, change the assigned property value in blocks.
cn: 错误： <color=lightblue>{0}</color> 所需類型： <Color=lightblue>{1}</Color>。 提供 类型： <Color=red>{2}</Color>。 若要解決該錯誤，請變更區塊中指派的屬性值。
kk: Қате: <color=lightblue>{0}</color> Талап етілетін тип: <Color=lightblue>{1}</Color>. Берілген тип: <Color=red>{2}</Color>. Қатені жою үшін, қасиеттің берілген мәнін блоклиде өзгертіңіз.
ru: Ошибка: <color=lightblue>{0}</color> Требуемый тип: <Color=lightblue>{1}</Color>. Предоставленный тип: <Color=red>{2}</Color>. Чтобы устранить ошибку, измените присваемое значение свойства в блокли.

# EXCEPTION_IN_OBJECT
source: Error in an object
cn: 對象錯誤
kk: Объектідегі қате
ru: Ошибка в объекте

# EXECUTE_LOGIC_ERROR
source: Logic execution failure
cn: 邏輯執行錯誤
kk: Логиканы орындау қатесі
ru: Ошибка выполнения логики

source: Exit
cn: 出口
kk: Шығу
ru: Выход

# EXIT_DESKTOP_PLAYER_MESSAGE
source: Are you sure you want to exit the desktop viewer?
cn: 您確定要退出 PC 視圖模式嗎？
kk: ДК-да қарау режимінен шыққыңыз келетініне сенімдісіз бе?
ru: Вы уверены, что хотите выйти из режима просмотра на ПК?

# EXIT_DESKTOP_PLAYER_TITLE
source: Exit desktop view mode
cn: 退出 PC 視圖
kk: ДК-да қарау режимінен шығу
ru: Выход из режима просмотра на ПК

# EXIT_NETTLEDESK_PLAYER_MESSAGE
source: Are you sure you want to exit Illumetry IO mode?
cn: 您确定要退出 Illumetry IO 模式吗？
kk: NettleDesk режимінен шыққыңыз келетініне сенімдісіз бе?
ru: Вы уверены, что хотите выйти из режима NettleDesk?

# EXIT_NETTLEDESK_PLAYER_TITLE
source: Exit Illumetry IO mode
cn: 退出 Illumetry IO 模式
kk: NettleDesk режимінен шығу
ru: Выход из режима NettleDesk

# EXIT_TO_AR
source: Switch to AR
cn: 切換到 AR
kk: AR-ға ауысып қосылу
ru: Переключиться в AR

# EXIT_TO_DESKTOP
source: Disable VR
cn: 關閉虛擬現實
kk: VR өшіру
ru: Выключить VR

# EXIT_TO_DESKTOP_FROM_AR
source: Disable AR
cn: 禁用 AR
kk: АR өшіру
ru: Выключить AR

# EXIT_TO_DESKTOP_FROM_NETTLEDESK
source: Disable Illumetry IO
cn: 关闭 Illumetry IO
kk: NettleDesk өшіру
ru: Выключить NettleDesk

# EXIT_TO_EDIT
source: Edit Mode
cn: 編輯模式
kk: Редакторлау режимі
ru: Режим редактирования

source: Exit to main menu?
cn: 退出主選單？
kk: Негізгі мәзірге шығу керек пе?
ru: Выйти в главное меню?

# EXIT_TO_NETTLEDESK
source: Switch to Illumetry IO
cn: 切換到 Illumetry IO
kk: NettleDesk-ке ауысып қосылу
ru: Переключиться в NettleDesk

# EXIT_TO_VR
source: Switch to VR
cn: 切換到虛擬現實
kk: VR-ға ауысып қосылу
ru: Переключиться в VR

# EXIT_VR_PLAYER_MESSAGE
source: Are you sure you want to exit VR mode?
cn: 您確定要退出 VR 視圖模式嗎？
kk: Сіз VR қарау режимінен шыққыңыз келетініне сенімдісіз бе?
ru: Вы уверены, что хотите выйти из режима VR просмотра?

# EXIT_VR_PLAYER_TITLE
source: Exit VR mode
cn: 退出 VR 視圖
kk: VR қарау режимінен шығу
ru: Выход из режима VR просмотра

source: Field of view
cn: 视野
kk: Шолу бұрышы
ru: Угол обзора

# GET_SCENE_TEMPLATE_DATA
source: Getting scene template data...
cn: 正在獲取有關場景模板的數據...
kk: Сахна шаблоны туралы деректерді алу...
ru: Получение данных о шаблоне сцены...

# GROUP_NOT_SAVED
source: Unsaved changes will be lost. Save the changes?
cn: 未保存的更改將丟失。節省？
kk: Сақталмаған өзгерістер жоғалады. Сақтау керек пе?
ru: Несохраненные изменения будут потеряны. Сохранить?

# HEADSET_NOT_FOUND_HINT
source: 1. Make sure your VR-headset is connected to your PC. 2. Make sure that <link="start_openxr"><b><u>OpenXR</u></b></link> runtime is running. 3. Restart the application.
cn: 1. 確保您的 VR 耳機已連接到您的計算機。 2. 檢查您是否正在運行 <link="start_steamvr"><b><u>SteamVR</u></b></link>. 3. 重新啟動程序。.
kk: 1. VR-шлем компьютерге қосулы тұрғанына көз жеткізіңіз. 2. Сізде <link="start_openxr"><b><u>OpenXR</u></b></link> орындау ортасы іске қосылғанын тексеріңіз. 3. Бағдарламаны қайтадан іске қосыңыз.
ru: 1. Убедитесь, что VR-шлем подключен к компьютеру. 2. Проверьте, что у вас запущена среда выполнения <link="start_openxr"><b><u>OpenXR</u></b></link>. 3. Перезапустите программу.

# HEADSET_NOT_FOUND_WITH_SETTINGS
source: 1. Make sure the VR headset is connected to your computer. 2. Verify that you have the <link="start_openxr"><b><u>OpenXR</u></b></link> runtime running. 3. Check that the current <link="start_openxr"><b><u>OpenXR</u></b></link> runtime environment is installed in the <link="open_settings"><b><u>settings</u></b></link>. 4. Restart the program.
cn: 1. 确保 VR 耳机 是 连接 到 您的 计算机。 2. 驗證您的 <link="start_openxr"><b><u>OpenXR</u></b></link> 運行時正在運行。 3. 檢查當前的 <link="start_openxr"><b><u>OpenXR</u></b></link> 運行環境已安裝在 <link="open_settings"><b><u>settings</u></b></link>. 4. 重新启动 程序。
kk: 1. VR-шлем компьютерге қосулы тұрғанына көз жеткізіңіз. 2. Сізде <link="start_openxr"><b><u>OpenXR</u></b></link> орындау ортасы іске қосылғанын тексеріңіз. 3. <link="open_settings"><b><u> мына теңшеулерде:</u></b></link> өзекті орындау ортасы: <link="start_openxr"><b><u>OpenXR</u></b></link> орнатылғанын тексеріңіз. 4. Бағдарламаны қайтадан іске қосыңыз.
ru: 1. Убедитесь, что VR-шлем подключен к компьютеру. 2. Проверьте, что у вас запущена среда выполнения <link="start_openxr"><b><u>OpenXR</u></b></link>. 3. Проверьте, что в <link="open_settings"><b><u>настройках</u></b></link> установлена актуальная среда выполнения <link="start_openxr"><b><u>OpenXR</u></b></link>. 4. Перезапустите программу.

# HEADSET_TRACKING_LOST
source: No Headsets Tracking
cn: 找不到頭盔
kk: Шлем табылған жоқ
ru: Шлем не найден

# HIERARCHY
source: Objects
cn: 場景中的物件
kk: Объектілер
ru: Объекты

# HIERARCHY_SCENE
source: Scene
cn: 場景
kk: Сахна
ru: Сцена

# HIERARCHY_SCENE_TEMPLATE
source: Scene template
cn: 场景模板
kk: Сахна шаблоны
ru: Шаблон сцены

source: Hue
cn: 語氣
kk: Тон
ru: Тон

# IN_OBJECT_HAS_ERROR
source: An error occurred in the object
cn: 对象发生错误
kk: Объектіде қате орын алды
ru: Произошла ошибка в объекте

# INIT_LOGIC_ERROR
source: Logic initialization error
cn: 邏輯初始化錯誤
kk: Логиканы инициализациялау қатесі
ru: Ошибка инициализации логики

source: Inspector
cn: 屬性
kk: Инспектор
ru: Инспектор

# INSPECTOR_MISSING_RESOURCE
source: Missing
cn: 失踪
kk: Жоқ
ru: Отстутствует

# INSPECTOR_PROPERTY_ACTION
source: Action
cn: 行动
kk: Әрекет
ru: Действие

# INSPECTOR_PROPERTY_OBJECT_NAME
source: Object Name
cn: 对象名称
kk: Объектінің аты
ru: Имя объекта

# INSPECTOR_PROPERTY_PROPERTY_NAME
source: Property name
cn: 物业名称
kk: Қасиеттің аты
ru: Имя свойства

# INSPECTOR_PROPERTY_RESOURCE_NAME
source: Resource name
cn: 资源 名称
kk: Ресурстың аты
ru: Имя ресурса

# JOIN_TO_ROOM
source: Joining room...
cn: 與房間的連接...
kk: Бөлмеге қосу...
ru: Подключение к комнате...

# LAMP
source: Simple Lightbulb
cn: 簡單的燈泡
kk: Қарапайым шам
ru: простая лампочка

source: Let's go!
cn: 去！
kk: Кеттік!
ru: Поехали!

source: Library
cn: 圖書館
kk: Кітапхана
ru: Библиотека

# LIBRARY_OBJECTS
source: Objects in library
cn: 庫中的對象
kk: Кітапханадағы объектілер
ru: Объектов в библиотеке

source: Library was changed
cn: 庫已更改
kk: Кітапхана өзгертілді
ru: Библиотека изменена

# LICENSE_KEY_ERROR
source: Can not get license information
cn: 無法獲取許可證信息
kk: Лицензия туралы ақпарат ала алмай жатырмын
ru: Не могу получить информацию о лицензии
